# RvtLinkPhaseMap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RvtLinkPhaseMap Property
ParameterTypeId Class See Also
---
"Phase Mapping"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RvtLinkPhaseMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RvtLinkPhaseMap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RvtLinkPhaseMap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace